HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxMsc_bf.h
/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL15 */
#define IFX_MSC_DSDSL_SL15_OFF (30)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL1 */
#define IFX_MSC_DSDSL_SL1_OFF (2)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL2 */
#define IFX_MSC_DSDSL_SL2_OFF (4)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL3 */
#define IFX_MSC_DSDSL_SL3_OFF (6)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL4 */
#define IFX_MSC_DSDSL_SL4_OFF (8)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL5 */
#define IFX_MSC_DSDSL_SL5_OFF (10)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL6 */
#define IFX_MSC_DSDSL_SL6_OFF (12)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL7 */
#define IFX_MSC_DSDSL_SL7_OFF (14)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL8 */
#define IFX_MSC_DSDSL_SL8_OFF (16)

/** \\brief  Length for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSL_Bits.SL9 */
#define IFX_MSC_DSDSL_SL9_OFF (18)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL16 */
#define IFX_MSC_DSDSLE_SL16_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL16 */
#define IFX_MSC_DSDSLE_SL16_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL16 */
#define IFX_MSC_DSDSLE_SL16_OFF (0)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL17 */
#define IFX_MSC_DSDSLE_SL17_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL17 */
#define IFX_MSC_DSDSLE_SL17_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL17 */
#define IFX_MSC_DSDSLE_SL17_OFF (2)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL18 */
#define IFX_MSC_DSDSLE_SL18_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL18 */
#define IFX_MSC_DSDSLE_SL18_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL18 */
#define IFX_MSC_DSDSLE_SL18_OFF (4)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL19 */
#define IFX_MSC_DSDSLE_SL19_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL19 */
#define IFX_MSC_DSDSLE_SL19_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL19 */
#define IFX_MSC_DSDSLE_SL19_OFF (6)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL20 */
#define IFX_MSC_DSDSLE_SL20_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL20 */
#define IFX_MSC_DSDSLE_SL20_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL20 */
#define IFX_MSC_DSDSLE_SL20_OFF (8)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL21 */
#define IFX_MSC_DSDSLE_SL21_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL21 */
#define IFX_MSC_DSDSLE_SL21_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL21 */
#define IFX_MSC_DSDSLE_SL21_OFF (10)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL22 */
#define IFX_MSC_DSDSLE_SL22_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL22 */
#define IFX_MSC_DSDSLE_SL22_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL22 */
#define IFX_MSC_DSDSLE_SL22_OFF (12)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL23 */
#define IFX_MSC_DSDSLE_SL23_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL23 */
#define IFX_MSC_DSDSLE_SL23_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL23 */
#define IFX_MSC_DSDSLE_SL23_OFF (14)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL24 */
#define IFX_MSC_DSDSLE_SL24_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL24 */
#define IFX_MSC_DSDSLE_SL24_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL24 */
#define IFX_MSC_DSDSLE_SL24_OFF (16)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL25 */
#define IFX_MSC_DSDSLE_SL25_OFF (18)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL26 */
#define IFX_MSC_DSDSLE_SL26_OFF (20)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL27 */
#define IFX_MSC_DSDSLE_SL27_OFF (22)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_MSK (0x3)

/** \\brief  Offset for Ifx_MSC_DSDSLE_Bits.SL28 */
#define IFX_MSC_DSDSLE_SL28_OFF (24)

/** \\brief  Length for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_LEN (2)

/** \\brief  Mask for Ifx_MSC_DSDSLE_Bits.SL29 */
#define IFX_MSC_DSDSLE_SL29_MSK (0x3)

